{
  "Acton Town":"Alphabetically, the first tube station on the network. Credit thenudge.com",
  "Aldgate":"Is built directly on top of a vast plague pit, where 1000's of bodies are apparently buried. No-one knows quite how many. Credit thenudge.com",
  "Aldgate East":"While engineers worked on lowering the track level, trains kept running as the existing line was precariously suspended on wooden trestles from the ceiling. Credit thenudge.com",
  "Alperton":"Has the only remaining wooden escalators on the network, bricked up behind a wall. Credit thenudge.com",
  "Amersham":"The highest station on the network, at a solid 147m above sea level. Credit thenudge.com",
  "Angel":"Has the Underground's longest escalator at 60m/197ft, with a vertical rise of 27.5m. In fact, they're the 4th longest in Western Europe. Credit thenudge.com",
  "Archway":"Hidden in the green & cream tiling pattern at Archway station, there are black arches. Credit thenudge.com",
  "Arnos Grove":"The design of the station – which is Grade II listed – was inspired by the Stockholm Public Library. Credit thenudge.com",
  "Arsenal":"The only station in the UK named after a football team. Credit thenudge.com",
  "Baker Street":"Has the most platforms of any tube station – 10. Credit thenudge.com",
  "Balham":"Balham is the only Underground station that doesn't have any of the letters of the word ‘underground' in it. Credit thenudge.com",
  "Bank":"Has the most entrances/exits of any tube station with 12. Credit thenudge.com",
  "Barbican":"The tube's first rail disaster happened here – 4 people died in 1866 and the trains were running again within half an hour. Credit thenudge.com",
  "Barking":"Currently has a direct freight service running 7,500 miles direct to & from the city of Yiwu, on China's east coast. Credit thenudge.com",
  "Barkingside":"Is the only station on the network with an ornate, medieval-style Hammerbeam Roof (usually only used in great halls or cathedrals). Credit thenudge.com",
  "Barons Court":"Mahatma Gandhi lived at 20 Barons Court Road, a few yards from the station, while studying law. Credit thenudge.com",
  "Bayswater":"Was originally called Queen's Road (Bayswater), but the name was changed to avoid confusion with Queensway, which was also called Queen's Road. And the kicker? There is no Queen's Road in Kensington. Credit thenudge.com",
  "Becontree":"When Beacontree was first built in the interwar period, it was the largest housing estate in the world – and a railway station was built specifically for it. Credit thenudge.com",
  "Belsize Park":"Belsize Park has a sign claiming that the stairs have 219 steps, but there are actually 189. Credit thenudge.com",
  "Bermondsey":"Is a perfect anagram of “Snob Remedy”. Credit thenudge.com",
  "Bethnal Green":"In Anglo Saxon, Bethnal Green literally means “happy corner”. Credit thenudge.com",
  "Blackfriars":"In January 2014 the Blackfriars Railway Bridge became the world's largest solar-powered bridge, having been covered with 4,400 photovoltaic panels providing up to half of the energy for the station. Credit thenudge.com",
  "Blackhorse Road":"Despite the black horses depicted in station murals, it's actually named after a nearby black house. Credit thenudge.com",
  "Bond Street":"Harry Selfridge drew up proposals for a direct subway connecting the station to his store, and for the station to be renamed ‘Selfridges'. The proposals were declined. Credit thenudge.com",
  "Borough":"As an architectural shortcut, it was essentially a replica of Kennington station when it was first built. Credit thenudge.com",
  "Boston Manor":"Thanks to its Art Deco design, the station appeared on a postage stamp in 2013. Credit thenudge.com",
  "Bounds Green":"Name-dropped in the lyrics to Has it Come to This? by The Streets. Credit thenudge.com",
  "Bow Road":"The steepest gradient on the tube network at 3.6%. Insanity. Credit thenudge.com",
  "Brent Cross":"Brent Cross station was named after the shopping centre when it opened nearby in 1976, not the other way around. Credit thenudge.com",
  "Brixton":"There's a mural in the station of a pyramid of bricks, which is a visual pun of a ton of bricks (or a ‘bricks ton'). Credit thenudge.com",
  "Bromley-by-Bow":"In EastEnders, the fictional Walford East tube station takes the place of Bromley-by-Bow. Credit thenudge.com",
  "Buckhurst Hill":"The only through station in zones 1 to 6 on the Underground to be in a zone on its own – passengers travelling from the station leaving in either direction must cross a zone boundary. Credit thenudge.com",
  "Burnt Oak":"The first ever Tesco was opened just down the road from the station, in 1929. The tins had no labels to keep cost down. Credit thenudge.com",
  "Caledonian Road":"Named after an asylum for Scottish children built nearby in 1828. Not as in mental asylum, but as in safe asylum. To be clear. Credit thenudge.com",
  "Camden Town":"Because the station is so busy at weekends, they're planning on rebuilding it, and demolishing Camden Market in the process (don't panic though, that doesn't include the Stables Market, The Lock Market, the Inverness Street market, etc.). Credit thenudge.com",
  "Canada Water":"Designed by the same architect as the Millennium Dome. Who was clearly copying his own homework. Credit thenudge.com",
  "Canary Wharf":"The busiest station to serve a single line, and it's had at least one wedding celebrated in it. Credit thenudge.com",
  "Canning Town":"There was another Canning Town station north of Barking road, but when the DLR came along, instead of adding a platform to the existing station, they simply demolished the whole thing and built a new one from scratch. Credit thenudge.com",
  "Cannon Street":"The name first appears as ‘Candelwrichstrete Street' in 1190. The name was shortened over 60 times, and eventually settled on Cannon Street in the 17th century. It is therefore not related to the firearms. Credit thenudge.com",
  "Canons Park":"Named after Cannons, a vast house built on the site in 1724 at the cost of £28m (adjusted for inflation). It was demolished and sold off brick by brick 20 years later. And therefore not related to the firearms, either. Credit thenudge.com",
  "Chalfont & Latimer":"The longest single journey between neighbouring stations: 9 mins on average to Chesham. Credit thenudge.com",
  "Chalk Farm":"The Roundhouse next door used to be a railway turntable servicing the station. Credit thenudge.com",
  "Chancery Lane":"In the '70s, the former air raid shelter built underneath the station was turned into a telephone exchange with 200 staff, its own restaurant, bar, and games room, all 200ft below the surface. Credit thenudge.com",
  "Charing Cross":"Modern day Charing Cross is an amalgamation of two old stations: Trafalgar Square and Strand. Credit thenudge.com",
  "Chesham":"Furthest away from any other station, at 3.8mi to the nearest neighbour. Credit thenudge.com",
  "Chigwell":"Serves the town of Chigwell, which Charles Dickens described as “the greatest place in the world”. Credit thenudge.com",
  "Chiswick Park":"Once known as Acton Green – the name was changed due to there being 7 other Acton stations already. Credit thenudge.com",
  "Chorleywood":"The name literally means “peasant's wood” (and currently has one of the highest qualities of life in the country). Credit thenudge.com",
  "Clapham Common":"For 2 weeks in September 2016, all of the adverts used in the station were replaced by photos of cats. Credit thenudge.com",
  "Clapham North":"Was the test site for the UK's first underground farm, housed in its deep level bomb shelter. The company now grows food under Clapham High Street. Credit thenudge.com",
  "Clapham South":"The station was originally to have been called ‘Nightingale Lane' and this name still exists hidden behind the blue bars on the platform roundels. Credit thenudge.com",
  "Cockfosters":"Being the final/first station on the line, it has a tunnel designed to mirror the one at Uxbridge at the opposing end of the line. Credit thenudge.com",
  "Colindale":"Was frequently used by T.E. Lawrence (AKA Lawrence of Arabia), who used the pen name ‘Colin Dale' during his journalistic career. Credit thenudge.com",
  "Colliers Wood":"The pub opposite is named after the architect who designed the station itself, Charles Holden. In fact, he designed a great many stations in his time. Credit thenudge.com",
  "Covent Garden":"London Underground's standard £4.80 single cash fare for the journey between here and Leicester Square equates to £29.81 a mile, making the fare for this particular journey more expensive per mile than the Orient Express. Credit thenudge.com",
  "Croxley":"A story is told of how a year after the opening of the station in 1926, a group of ladies was directed to it by Croxley's policeman P.C. Haggar. He bade them a cheery “Good-night” – to learn shortly afterwards that they were a band of suffragettes who had set fire to the new station. Credit thenudge.com",
  "Dagenham East":"Was the site of a rail crash in 1958 due to fog – and the train that caused it is still active on the Severn Valley Railway. Credit thenudge.com",
  "Dagenham Heathway":"Despite being smaller, and having fewer platforms, gets twice the number of passengers per year as Dagenham East. Credit thenudge.com",
  "Debden":"Debden station was the setting for the Victorian ballad “The Chigwell Stationmaster's Wife”. Not Chigwell. Credit thenudge.com",
  "Dollis Hill":"Dollis Hill played a part in the Second World War, as the code-breaking computer used at Bletchley Park was built here. Credit thenudge.com",
  "Ealing Broadway":"Platforms 8 & 9 still contain some of the pre-roundel logo designs. Credit thenudge.com",
  "Ealing Common":"Has a heptagonal ticket hall, one of only two on the network. Credit thenudge.com",
  "Earl's Court":"The site of the last remaining blue police telephone box – radios took over in the 1970s. Credit thenudge.com",
  "East Acton":"Not actually in the borough of Acton, it just took the name to be part of the trend – there are seven Acton stations on the network. Credit thenudge.com",
  "East Finchley":"Jerry Springer was born in the station during an air raid in WW2. Credit thenudge.com",
  "East Ham":"Between 1851 when the station wan built, and 1911, East Ham's population grew by 7585%. Credit thenudge.com",
  "East Putney":"On 1 April 1994, it was sold to London Underground for the princely sum of £1. Credit thenudge.com",
  "Eastcote":"Was originally called Ascot. Credit thenudge.com",
  "Edgware":"Was supposed to connect to Mill Hill East, and you can still see the disused track that leads to it... Credit thenudge.com",
  "Edgware Road":"Has a “living wall” wall of plants outside the station, the only one in the underground network. Credit thenudge.com",
  "Elephant & Castle":"Named after a nearby pub, which itself was name-dropped in Shakespeare's Twelfth Night. Credit thenudge.com",
  "Elm Park":"Celebrations to mark the opening of the station in 1935 included a performance by the Dagenham Girl Pipers – they performed in Nazi Germany around the same time, and Hitler is said to have remarked: “I wish I had a band like that”. Credit thenudge.com",
  "Embankment":"Has a huge, empty substation attached to it, abandoned since 1957. Called ‘Pages Walk' it's behind a blast door in the station, and is so large it's been proposed as a possible nightclub location. Credit thenudge.com",
  "Epping":"Has the largest public London Underground station car park with 519 spaces. It's usually still full by around 6.30am each day though. Credit thenudge.com",
  "Euston":"Has a bench made from 450million year old stone outside of it. Credit thenudge.com",
  "Euston Square":"Was the place that the very first piece of work on the underground – or any underground railway on earth – took place. A shaft was sunk in January 1860 there. Credit thenudge.com",
  "Fairlop":"The only tube station named after a tree. Apart from, technically Burnt Oak. Credit thenudge.com",
  "Farringdon":"Originally designed to transport livestock to Smithfield market – there are still cattle ramps onto the street West Smithfield for this purpose. Credit thenudge.com",
  "Finchley Central":"Has an original copy of the Harry Beck Tube map on display; he lived nearby and used the station frequently. Credit thenudge.com",
  "Finchley Road":"Analysis of earth removed when tunnelling towards the station revealed that its site was the southern limit of a glacier which covered Britain in one of the Ice Ages. Credit thenudge.com",
  "Finsbury Park":"Due to confusion with popular duelling site Finsbury Field, when it opened the station was decorated with mosaics of duelling pistols. They're still there today. Credit thenudge.com",
  "Fulham Broadway":"It's the station in 1998's Sliding Doors where reality changes because of a missed train. Credit thenudge.com",
  "Gants Hill":"The easternmost station to be entirely below ground on the London Underground network. Credit thenudge.com",
  "Gloucester Road":"Has a disused platform that's used as a permanent art exhibition. ...Technically making it a used platform. Credit thenudge.com",
  "Golders Green":"Was the last station on the Northern line to retain semaphore signals, replaced in 1950. Credit thenudge.com",
  "Goldhawk Road":"The line running through Goldhawk Road station was active as early as 1864, yet no station opened there until 1914. Credit thenudge.com",
  "Goodge Street":"Not actually on Goodge Street – it's closer to both Tottenham Street and Whitfield Street. Credit thenudge.com",
  "Grange Hill":"Destroyed by a V1 “doodlebug” bomb during WW2. Credit thenudge.com",
  "Great Portland Street":"Despite having three lines run through it, it only has one pair of tracks, making it one of the most intensely used parts of the network. Credit thenudge.com",
  "Green Park":"Named after the park, which itself is said to have originally been a swampy burial ground for lepers from nearby St James' hospital. Credit thenudge.com",
  "Greenford":"Used its original, century-old wooden escalator right up until 2014. Credit thenudge.com",
  "Gunnersbury":"On 8 December 1954 the station was damaged by a tornado which ripped off the roof and injured six people. Credit thenudge.com",
  "Hainault":"The lifts are the shallowest on the London Underground network, having a descent of just 0.67 metres. Credit thenudge.com",
  "Hammersmith":"Technically, it's two stations – one District/Piccadilly, one Hammersmith & City/Circle. And to get from one to the other without walking would require a minimum of 10 stops and 3 changes. Credit thenudge.com",
  "Hampstead":"The deepest station on the line, at 58m below ground – that's more than Nelson's Column. Credit thenudge.com",
  "Hanger Lane":"In a reversal of most other stations, it has to be entered underground, but the station itself is entirely above ground. Credit thenudge.com",
  "Harlesden":"Is almost twice as far away from Harlesden town centre as Willesden Junction is. Credit thenudge.com",
  "Harrow & Wealdstone":"Technically the oldest station on the network: the mainline station was built in 1837, predating Baker Street by 24 years. It was opened for Underground trains in 1917. Credit thenudge.com",
  "Harrow-on-the-Hill":"It's actually on Green Hill, north of Harrow Hill. Credit thenudge.com",
  "Hatton Cross":"On its opening in 1975, Hatton Cross was one of 279 active stations on the London Underground, the highest ever total; the number of stations in the network has since decreased to 270. Credit thenudge.com",
  "Heathrow Terminal 4":"It is the only station on the network to have one-way train service. Credit thenudge.com",
  "Heathrow Terminal 5":"Despite being underground, the ceiling is made from laminate panels, allowing natural daylight to illuminate it. Credit thenudge.com",
  "Heathrow Terminals 2 & 3":"Back when it opened in 1977, it was the first time that an airport had been directly served by an underground railway system. Credit thenudge.com",
  "Hendon Central":"When it was first built, the station was surrounded by fields – the town was essentially constructed around it. Credit thenudge.com",
  "High Barnet":"Is situated on the hill that's thought to be the inspiration for the nursery rhyme The Grand Old Duke of York. Credit thenudge.com",
  "High Street Kensington":"Once had a waiting room for passengers who didn't fancy the platform. This was changed into a break room for drivers. Credit thenudge.com",
  "Highbury & Islington":"Despite being hit by a V-1 flying bomb during WW2, the original station building stayed in use until it was demolished in 1960. Credit thenudge.com",
  "Highgate":"The disused platforms and tunnels have sometimes been used for filming and have appeared in several productions including the feature film Paperhouse, and the television series EastEnders and Waking the Dead. Credit thenudge.com",
  "Hillingdon":"The name Hillingdon is Middle English, and means “Hill's hill”. Credit thenudge.com",
  "Holborn":"Was used to store British Museum treasures during WW2. A newspaper even offered a cash reward to anyone who dared spend the night there in the 60s amid rumours of a mummy ghost – nobody took them up on it. Credit thenudge.com",
  "Holland Park":"Built with a flat roof in order for a retail unit to be built on top of it. 115 years later, there is still no retail unit. Credit thenudge.com",
  "Holloway Road":"Used to have a spiral escalator (which is now stored in the Acton depot). Credit thenudge.com",
  "Hornchurch":"In the 80 years since the station was built, Hornchurch's population increased by x43 times. Credit thenudge.com",
  "Hounslow Central":"Replaced Hounslow Town tube station, which was open for just three years. Credit thenudge.com",
  "Hounslow East":"In the 1700s, the nearby heath was notorious for successful Highwaymen – which is a neat coincidence, because Hounslow East is a perfect anagram for ‘outlaws shone'. Credit thenudge.com",
  "Hounslow West":"Due to the nearby military barracks, Winston Churchill used to frequent this station. Credit thenudge.com",
  "Hyde Park Corner":"The station is located entirely underground, with no surface presence – though there is an old station building that has since been used as a pizza restaurant and a hotel. The lifts from that building are now ventilation shafts. Credit thenudge.com",
  "Ickenham":"Said to be haunted each Christmas since the '50s by a woman in a red scarf, who was electrocuted there. She flails her arms, apparently. Credit thenudge.com",
  "Kennington":"Stay on a terminating Northern line train heading south at Kennington and you'll go round in a loop, arriving back at Kennington and heading north. People who are drunk/asleep have been known to end up in Edgware, rather than in Morden. Credit thenudge.com",
  "Kensal Green":"In December 2006, the station was hit (or at least grazed) by a tornado. Credit thenudge.com",
  "Kensington (Olympia)":"The station's old name, ‘Addison Road Station' still appears sculpted into a wall on the eastern pedestrian exit. Credit thenudge.com",
  "Kentish Town":"There used to be a South Kentish Town tube station down the road. It became disused after strike action from the power station supplying it caused it to shut down, and they simply never re-opened it, even when the power came back on. Credit thenudge.com",
  "Kenton":"Both Kenton, Kennington, and Kensington are, by total coincidence, derived from the same name – Keninton. Credit thenudge.com",
  "Kew Gardens":"The Tube's track is crossed by Kew Gardens Station Footbridge, a Grade II listed feature in its own right – it was designed specifically to prevent smoke from steam trains getting into people's clothing. Credit thenudge.com",
  "Kilburn":"At the turn of the 20th Century the station was going to be replaced with “a type of subterranean monorail roller coaster”, but plans were (sadly) abandoned. Credit thenudge.com",
  "Kilburn Park":"The first station to be designed around escalators, rather than lifts. Credit thenudge.com",
  "King's Cross St Pancras":"Has the shortest lift shaft on the network, at just 2.3 metres. Credit thenudge.com",
  "Kingsbury":"Was originally on the Metropolitan Line, before being transferred to the Bakerloo Line, and finally landing on the Jubilee Line. Credit thenudge.com",
  "Knightsbridge":"Suffered huge congestion problems, which were solved when they built an exit specifically for Harrods. Credit thenudge.com",
  "Ladbroke Grove":"Was originally called Notting Hill, but the name was changed to avoid confusion with Notting Hill Gate. There's now a movement to change the name to Portobello Road, despite the fact that it's not on Portobello Road. It's on Ladbroke Grove. Credit thenudge.com",
  "Lambeth North":"Has been called Kennington Road, Westminster Bridge Road, and finally Lambeth North. Credit thenudge.com",
  "Lancaster Gate":"Despite its name, the station is close to the Marlborough Gate entrance to Hyde Park/Kensington Gardens, about 300m to the east of the Lancaster Gate entrance. Credit thenudge.com",
  "Latimer Road":"Is actually located half a kilometer away from Latimer Road. Credit thenudge.com",
  "Leicester Square":"On all four platforms, film sprockets are painted down the entire length and on the top and bottom of the display area (blue on the Piccadilly line platforms, and black on the Northern line platforms), due to the four premiere cinemas in Leicester Square. Credit thenudge.com",
  "Leyton":"Is home to one of the most accident-prone stretches of the Underground network: the line between Leyton & Stratford has had several fatal crashes, including one in 1953 in which 12 people died, the worst accident on the tube at the time. Credit thenudge.com",
  "Leytonstone":"Features 17 mosaics of Alfred Hitchcock films & famous moments. Credit thenudge.com",
  "Liverpool Street":"Built on the original site of the Bethlehem (Bedlam) mental asylum. Credit thenudge.com",
  "London Bridge":"Is the only station on the entire London Underground network with the word “London” in its name. Credit thenudge.com",
  "Loughton":"The station was originally built so that City workers would have easy access to Epping Forest. Credit thenudge.com",
  "Maida Vale":"When Maida Vale station opened on 6 June 1915 it was entirely staffed by women due to shortages of male staff in the war. Credit thenudge.com",
  "Manor House":"Of its street-level entrances, three are in Hackney, and one is in Haringey. Credit thenudge.com",
  "Mansion House":"Has all five vowels in its name. Credit thenudge.com",
  "Marble Arch":"The marble arch opposite the station was originally going to be the entrance to Buckingham Palace. Credit thenudge.com",
  "Marylebone":"Very nearly wasn't built because it might have disturbed the cricket played at Lords. It took an act of parliament to finally push construction through. Credit thenudge.com",
  "Mile End":"Is named so because it's exactly one mile from the eastern boundary of The City of London. Credit thenudge.com",
  "Mill Hill East":"Features a Creditduct in which trains travel 18m above ground – the highest point on the Underground network. Credit thenudge.com",
  "Monument":"Its original name, Eastcheap, lasted precisely one month before it was changed to Monument. Credit thenudge.com",
  "Moor Park":"Has a “secret” unmarked entrance adjacent to a golf course. Credit thenudge.com",
  "Moorgate":"Has a virtually unknown second underground network/line which starts here – the Northern City Line runs from Moorgate to Finsbury Park, and is't run by TFL. Credit thenudge.com",
  "Morden":"Is the start of the longest tunnel on the Underground network, running 27.8 kilometres (17.3 mi) to East Finchley Credit the Bank branch. Credit thenudge.com",
  "Mornington Crescent":"Is the subject of a deliberately incomprehensible gameshow on BBC Radio 4, in which there are no rules. Credit thenudge.com",
  "Neasden":"The Tube celebrated its centenary here in 1963 with a series of events including a parade of underground trains. Credit thenudge.com",
  "Newbury Park":"The bus shelter attached to it is Grade II listed. The station isn't. Credit thenudge.com",
  "North Acton":"Station staff regularly participate in Transport for London's annual Underground in Bloom competition, and in 2010 won first prize in the Fruit and Vegetable category, for their sweetcorn and strawberries. Credit thenudge.com",
  "North Ealing":"Is not actually north of Ealing, but east of it. Credit thenudge.com",
  "North Greenwich":"Despite its name, it is not in the area historically known as North Greenwich, on the Isle of Dogs, north of the River Thames; an entirely different North Greenwich station used to be there, between 1872 and 1926. Credit thenudge.com",
  "North Harrow":"Has been awarded the “Best Customer Service” trophy at the London Transport Awards – no surprise, the station master is called James Bond. Credit thenudge.com",
  "North Wembley":"The safest tube station on the entire network, according to the MET. Credit thenudge.com",
  "Northfields":"The 5th president of the US, John Quincey Adams lived next to the site of the station for two years. Credit thenudge.com",
  "Northolt":"Northala park next door features four man-made hills, constructed from the waste rubble of Wembley stadium. Credit thenudge.com",
  "Northwick Park":"Is only 350m from Kenton station, making it the closest tube station pair outside zone 1. Credit thenudge.com",
  "Northwood":"Is actually at a higher level than Northwood Hills. Credit thenudge.com",
  "Northwood Hills":"Before it opened in 1933, there was a competition to name it. This was, apparently, the winning entry, despite the station being lower than Northwood. Credit thenudge.com",
  "Notting Hill Gate":"The reason it's called Notting Hill Gate is because it was literally a gate: it used to be a toll road. Credit thenudge.com",
  "Oakwood":"The booking hall originally had a plaque claiming that the station occupied ‘the highest point in Europe in a direct line west of the Ural Mountains of Russia', which is a very strange way of saying that it's 300 feet above sea level. Credit thenudge.com",
  "Old Street":"It's buried in soil so acidic that the cast iron tunnel linings had to be replaced in the '90s due to corrosion. Credit thenudge.com",
  "Osterley":"This building replaced the earlier Osterley & Spring Grove station, 300 metres away, which is now Osterley Bookshop. Inside the bookshop the archway to the platforms is still visible, but blocked off, and the platforms behind are still in place. Credit thenudge.com",
  "Oval":"The first railway station to employ electrified tracks in London. Credit thenudge.com",
  "Oxford Circus":"In 1969, to celebrate the opening of the new Victoria Line, The Queen ‘took the wheel' of a train, and drove it from Green Park to Oxford Circus. Credit thenudge.com",
  "Paddington":"The track running towards Bayswater passes under 23-24 Leinster Road – a facade constructed to match neighbouring terrace houses. disguising where the original house was demolished to allow a gap in the tube system for steam trains to er …let off steam. Credit thenudge.com",
  "Park Royal":"The station plaforms aren't actually level – they slope up from south to north. Credit thenudge.com",
  "Parsons Green":"Is an anagram of “passenger ron”. Credit thenudge.com",
  "Perivale":"Is an anagram of “rail peve”. Credit thenudge.com",
  "Piccadilly Circus":"A world map in the station ticket hall, dating from the 1920s, contains a linear clock that shows the time in all parts of the world. Credit thenudge.com",
  "Pimlico":"Originally named after Ben Pimlico, a Hoxton brewer famous for his nut brown ale. It was so insanely popular with the residents of Pimlico, the place became named after him. Credit thenudge.com",
  "Pinner":"In 2009, a Pyrenean Mountain Dog named Rufus became a minor celebrity for his daily commute from Pinner to Baker Street due to his enormous size. Credit thenudge.com",
  "Plaistow":"Prior to the station being put in, Plaistow was “a whole day's coach ride” to Westminster. Afterwards, it took less than half an hour. Credit thenudge.com",
  "Preston Road":"Was originally named “Preston Road Halt for Uxendon and Kenton”, which would have made it easily the longest name on the line, and the only one with an actual instruction. Credit thenudge.com",
  "Putney Bridge":"Technically not in Putney – it's on the Fulham side of the Thames. Credit thenudge.com",
  "Queen's Park":"The site of the only “carriage shed” on the tube line: a wooden garden shed-like tunnel that you pass through on the northward part of your journey. Credit thenudge.com",
  "Queensbury":"The name Queensbury did not, when it was chosen, refer to any pre-existing area. It was coined by analogy with the adjacent Kingsbury station. Credit thenudge.com",
  "Queensway":"Named Queen's Road originally (because Queen Victoria was born nearby), but people thought that ‘lacked distinctiveness', so was changed. Credit thenudge.com",
  "Ravenscourt Park":"The least Instagrammed station in London, with zero posts for the whole of 2016. Credit thenudge.com",
  "Rayners Lane":"When the station first opened, there was only one single house nearby, owned by a farmer named Daniel Rayner. The station was duly called Rayner's Lane. Credit thenudge.com",
  "Redbridge":"During WW2, the train tunnels at Redbridge were used as an aircraft parts factory. Credit thenudge.com",
  "Regent's Park":"A parliamentary law originally declared that no station could be built at the current site – it was overturned, but there's still no surface station here. Credit thenudge.com",
  "Richmond":"Built from Portland Stone – a Jurassic era limestone from Dorset used in the construction of Buckingham Palace, St. Paul's Cathederal, and the UN Building in New York. Credit thenudge.com",
  "Rickmansworth":"Is a surprising hub for film locations: scenes for both Indiana Jones and the Raiders of the Lost Ark, and the Last Crusade were filmed literally two minutes north of the station, as well as Bridget Jones and the Edge of Reason, and Blackadder. Credit thenudge.com",
  "Roding Valley":"The quietest tube station on the line, each year transporting the same number of passengers as Waterloo does in one day. Credit thenudge.com",
  "Royal Oak":"Named after a nearby pub (still there, but now called The Porchester). Credit thenudge.com",
  "Ruislip":"Due to the convoluted tracks, it's actually possible to reverse trains here, but it takes up both platforms, so it's not done at peak hours. Credit thenudge.com",
  "Ruislip Gardens":"The station achieved poetic immortality in Poet Laureate John Betjeman's poem Middlesex. Credit thenudge.com",
  "Ruislip Manor":"Suffered heavy aerial bombardment by the Luftwaffe during WW2, due to its proximity to RAF Northholt. Credit thenudge.com",
  "Russell Square":"The sign lists the number of steps as 175. There as in fact, 171. Quite why no-one double checked is a mystery. Credit thenudge.com",
  "Seven Sisters":"Named after seven elm trees which have stood in the neighbourhood since the 1730s. The current trees were planted by five families of seven sisters. Credit thenudge.com",
  "Shepherd's Bush":"The station has no lifts because, due to nearby utilities, they would cost £100m to install. Adjusted for inflation, that's about half the cost of the construction of entire Metropolitan Line. Credit thenudge.com",
  "Shepherd's Bush Market":"Until 2008, it was also called Shepherd's Bush until it was renamed to avoid confusion. Credit thenudge.com",
  "Sloane Square":"The River Westbourne literally runs through the station – it was redirected through its own little bridge suspended over the main platform. Credit thenudge.com",
  "Snaresbrook":"Most of the station's Victorian features remain today, including brick buildings, extensive cast iron, and timber canopies. Credit thenudge.com",
  "South Ealing":"Has all five vowels in its name. Credit thenudge.com",
  "South Harrow":"The train actually travels over a marsh north of the station. It crosses it Credit aquaduct. Credit thenudge.com",
  "South Kensington":"Between South Kensington and Knightsbridge, the tube steers away from following the road above it in order to avoid a large plague pit. Credit thenudge.com",
  "South Kenton":"Its platform was built too high for the trains, and never corrected. Credit thenudge.com",
  "South Ruislip":"The concrete, glass and granite chip frieze in the booking hall is one of the earliest public works by glass artist, Henry Haig, who would go onto become one of Britain's most revered stained glass artists. Credit thenudge.com",
  "South Wimbledon":"Opening in 1926, the originally proposed name was Merton Grove, but it was renamed South Wimbledon to try and sound classier. Credit thenudge.com",
  "South Woodford":"The only station in which the name on the station's own roundels is different to the official name – they call it South Woodford (George Lane). Credit thenudge.com",
  "Southfields":"The station platform undergoes a makeover each year to coincide with the Wimbledon tennis tournament. Wimbledon station doesn't. Credit thenudge.com",
  "Southgate":"When it first opened, local residents were given a free return ticket to Piccadilly Circus to encourage them to use the service. Credit thenudge.com",
  "Southwark":"Southwark Station's blue cone wall, built as part of the Jubilee line extension's new generation of stations, was inspired by an 1816 stage set for The Magic Flute. Credit thenudge.com",
  "St James's Park":"Is a Grade 1 listed building, making station improvements considerably difficult. Credit thenudge.com",
  "St John's Wood":"Famously, the only station on the Underground network not to share any letters with the word “mackerel”. Credit thenudge.com",
  "St Paul's":"During the Second World War, the electricity grid control room for the entire of London and Southeast England was housed here, in the lift shaft. Credit thenudge.com",
  "Stamford Brook":"The first tube station to have an automatic ticket barrier installed on 5 January 1964. Credit thenudge.com",
  "Stanmore":"Was a secret outstation for Bletchley Park during WW2 – in fact, the crosswords decorating the station house are a reference to the test WW2 codebreakers had to pass to qualify for consideration: completing the Times crossword in under 12minutes. Credit thenudge.com",
  "Stepney Green":"A Tudor-era bowling ball was unearthed during the Crossrail excavations under the station. Credit thenudge.com",
  "Stockwell":"Just below the station platforms, there is an air raid shelter comprised of two tunnels, both six times the length of the platrforms themselves. They're currently used as a secure archive. Credit thenudge.com",
  "Stonebridge Park":"The booking hall is the only original feature – the rest has been destroyed by WW2 boming, and two major fires. Credit thenudge.com",
  "Stratford":"Has the shortest escalator on the network, with a vertical rise of 4.1m. Credit thenudge.com",
  "Sudbury Hill":"The station is said to have one of the highest levels of ‘pigeon customers' in the whole London Underground network. Staff often have to chase large numbers of the birds out of the ticket hall. Credit thenudge.com",
  "Sudbury Town":"Has a barometer hanging above the ticket hall from the 1930s – in fact, it's the only station with a barometer still in it. Credit thenudge.com",
  "Swiss Cottage":"Named after the nearby pub. Credit thenudge.com",
  "Temple":"On the columns at Temple station, there are small temple-shaped emblems at the bases. Credit thenudge.com",
  "Theydon Bois":"Is the only part of Theydon Bois that has street lighting – the rest of the town has none in order to maintain ambiance. Credit thenudge.com",
  "Tooting Bec":"Has a crater on Mars named after it. Credit thenudge.com",
  "Tooting Broadway":"The big statue of Edward VII at the entrance was paid for entirely by the public when it was made in 1911. Credit thenudge.com",
  "Tottenham Court Road":"Was originally called Oxford Street (before Oxford Circus opened). Credit thenudge.com",
  "Tottenham Hale":"Has been the site of no less than five collisions & derailments. Credit thenudge.com",
  "Totteridge & Whetstone":"Was originally named ‘Whetstone and Totteridge', owing to the fact that it is in Whetstone. But the name was switched, for reasons we still can't tell. Credit thenudge.com",
  "Tower Hill":"King Henry VIII beheaded noble traitors to the crown and two of his wives here. Not like, in the station, but next door to it. Credit thenudge.com",
  "Tufnell Park":"On the service board at Tufnell Park station you'll find ‘Poetry Corner', the station staff's daily selection of poetry by local residents, school children and famous poets, ‘giving passengers something to read while they're waiting for the lifts'. Credit thenudge.com",
  "Turnham Green":"Wheeler's Florist, based directly outside the station, has provided flowers for Bond & Batman movies. Which, apparently, had flowers in them. Credit thenudge.com",
  "Turnpike Lane":"The name ‘Turnpike Lane' refers to a toll gate erected there in 1767. And of course, the tube barriers there now techincally are a toll gate, meaning the name is still accurate. Credit thenudge.com",
  "Upminster":"The speed of sound was first accurately measured from the church next to the station. Credit thenudge.com",
  "Upminster Bridge":"Displayed a swastika in its ticket hall when it was built in 1934. They took it down a few years later for some reason or another. Credit thenudge.com",
  "Upney":"The Gunpowder Plot was hatched in a manor house next to the station. Credit thenudge.com",
  "Upton Park":"The station's name is cockney slang for crazy (because they're ‘two stops short of Barking'). Credit thenudge.com",
  "Uxbridge":"Being the final/first station on the line, has a tunnel designed to mirror the one at Cockfosters at the opposing end of the line. Credit thenudge.com",
  "Vauxhall":"Thanks to the creamery next door, it used to run daily ‘milk trains' entirely filled with the white stuff. They would pull into the station, and pour their contents into a dischrage pipe that led directly to the creamery. Credit thenudge.com",
  "Victoria":"Plays a key role in Oscar Wilde's The Importance of Being Earnest – the main character was discovered as a baby in a handbag in the station. Credit thenudge.com",
  "Walthamstow Central":"Originally called ‘Hoe Street'. Credit thenudge.com",
  "Wanstead":"The tunnels between Wanstead and Gants Hill to the east were turned into munitions factories during WW2. Credit thenudge.com",
  "Warren Street":"Used as the location for the 1972 British horror film, Death Line, which featured a family of cannibals living on the London Underground. Credit thenudge.com",
  "Warwick Avenue":"A song named after it by singer Duffy reached number 3 in the charts. Credit thenudge.com",
  "Waterloo":"Has 23 escalators, the most of any station on the network. Credit thenudge.com",
  "Watford":"Due to not being in the centre of town, has been threatened with closure since 1927. And it may well finally be closed in 2020. Credit thenudge.com",
  "Wembley Central":"Despite servicing Wembley Stadium, is only the 142nd busiest station on the line. Credit thenudge.com",
  "Wembley Park":"Was originally constructed to serve Wembley Pleasure Grounds, which were to be centrepieced by a tower taller than the Eiffel Tower. Credit thenudge.com",
  "West Acton":"The original 1923 station was rebuilt by 1940 – and it's now Grade II listed. Credit thenudge.com",
  "West Brompton":"The Overground lines here were built in 1866 (before the district line) as part of the West London Line – which was closed between 1940 and 1999 due to WWII bombing. Credit thenudge.com",
  "West Finchley":"Made predominantly from fittings taken from other stations in the North of England. The bridge apparently came from Yorkshire. Credit thenudge.com",
  "West Ham":"Has more platforms (8) than Charing Cross (6). Credit thenudge.com",
  "West Hampstead":"Was originally known as “West End” until the name was changed in order to avoid confusion with, well, the West End. Credit thenudge.com",
  "West Harrow":"Is, perhaps ironically, the station people travel to in order to get to Britain's biggest walking festival. Credit thenudge.com",
  "West Kensington":"Being next to the Queen's Club, it's 5x closer to a grass court tennis court than Wimbledon station. Credit thenudge.com",
  "West Ruislip":"The longest journey you can take without a change on the entire Underground network is the 37 miles from West Ruislip to Epping. Credit thenudge.com",
  "Westbourne Park":"Was the first station to be demolished. It was relocated in 1871. Credit thenudge.com",
  "Westminster":"Excavations for creating the deep level Jubilee line platforms caused Big Ben to move 35millimeters. Any more, and the tower would have cracked and possibly collapsed. Credit thenudge.com",
  "White City":"The architectural design of the station won an award at the 1951 Festival of Britain. Credit thenudge.com",
  "Whitechapel":"Whitechapel is the only place on the network where the Overground runs below the Underground. Credit thenudge.com",
  "Willesden Green":"When he was mayor, Ken Livingstone used to get the tube to work from here every day. Credit thenudge.com",
  "Willesden Junction":"In 1896 staff totalled 271, including 79 porters, 58 signalmen (in 14 signal boxes) and 58 shunters and yard foremen. Credit thenudge.com",
  "Wimbledon":"Laddie the Airedale Terrier was based at the station for six years, before retiring in 1956. During his time there, he collected £5,000 pounds in the change box on his back. Credit thenudge.com",
  "Wimbledon Park":"Despite being the closest station to the All England Club, is still closer to Wimbledon golf club than the tennis club. Credit thenudge.com",
  "Wood Green":"Gets name-dropped in songs by Razorlight (Los Angeles Waltz), Mark Knopfler (Junkie Doll), Pablo Gad (Black Before Creation), and Sway DaSafo (Up Your Speed). Credit thenudge.com",
  "Wood Lane":"Newest station on the network, opened in October 2008. Credit thenudge.com",
  "Woodford":"A wooden owl was put into the station's rafters during recent refurbishment as a reference to the owl sanctuary nearby. Credit thenudge.com",
  "Woodside Park":"Alphabetically, the last name on the entire Tube network. Credit thenudge.com"
}
